
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details>
<summary>Show Plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["app-web-tianyi"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"118003035d0d5b215a64a396938930ff12aead603cc88812bdb9ad5f5de339ce\"" -> "W/\"bbd7560611798b6eb69d6963ee4c95bab7ee1b713f806b9a7e8fed3ed40b5369\""
        id                                      = "app-web-tianyi"
        name                                    = "app-web-tianyi"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (14 unchanged elements hidden)
        ]
      ~ vulnerability_alerts                    = true -> false
        # (35 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }

  # module.repositories["ci-actions-common"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"6ab0496537ec3626c93d45f89b7ff53c53303dc99ab9cedfbe2cb203b20a0427\"" -> "W/\"9ae1c39e9881df4c0fc3d598378202ade42c64210c3890921fe885fc7acae2a7\""
        id                                      = "ci-actions-common"
        name                                    = "ci-actions-common"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }

      + template {
          + include_all_branches = false
          + owner                = "shishifubing"
          + repository           = "template-repository-default"
        }
    }

  # module.repositories["infra-repos-shishifubing"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"7a9756cebf120ea7e40d852e88dc27734373ec910471f7e0c8e58ea307f2f586\"" -> "W/\"8d24f1af810c0abe17e7cfe4e53a6601c67ada4a54e79eb8ef5dee4b711f33e3\""
        id                                      = "infra-repos-shishifubing"
        name                                    = "infra-repos-shishifubing"
      ~ topics                                  = [
          + "conventional-commits",
          + "semver",
            # (5 unchanged elements hidden)
        ]
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_organization_settings.organization will be updated in-place
  ~ resource "github_organization_settings" "organization" {
      ~ advanced_security_enabled_for_new_repositories               = false -> true
      - description                                                  = "事实浮冰" -> null
        id                                                           = "122202585"
      ~ secret_scanning_push_protection_enabled_for_new_repositories = false -> true
        # (19 unchanged attributes hidden)
    }

  # gitlab_project.repositories[".github"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Organization readme [mirror of https://github.com/shishifubing/.github] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/.github.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "dot-github"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "readme",
          + "readme-profile",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-android-anki-chinese-flashcards-enricher"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Android app to streamline my Chinese learning workflow [mirror of https://github.com/shishifubing/app-android-anki-chinese-flashcards-enricher] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-android-anki-chinese-flashcards-enricher.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-android-anki-chinese-flashcards-enricher"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "android",
          + "app",
          + "kotlin",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-cli-autoscroll"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Cross-platform CLI app enabling autoscroll [mirror of https://github.com/shishifubing/app-cli-autoscroll] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-cli-autoscroll.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-cli-autoscroll"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "cli-app",
          + "finished",
          + "finished-project",
          + "pyqt5",
          + "python",
          + "python3",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-desktop-useless-cpp-gui"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Desktop GUI written using C++ and Qt, it does absolutely nothing [mirror of https://github.com/shishifubing/app-desktop-useless-cpp-gui] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-desktop-useless-cpp-gui.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-desktop-useless-cpp-gui"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "abandoned",
          + "abandoned-project",
          + "appimage",
          + "ci",
          + "cpp",
          + "desktop-app",
          + "gui",
          + "qt",
          + "qt5",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-crawler-book-creator"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Web scraper I was building in java a long time ago and  started remaking using Django [mirror of https://github.com/shishifubing/app-web-crawler-book-creator] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-crawler-book-creator.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-web-crawler-book-creator"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "abandoned",
          + "abandoned-project",
          + "app",
          + "css",
          + "css3",
          + "django",
          + "html",
          + "html5",
          + "javascript",
          + "python",
          + "python3",
          + "shishifubing",
          + "web-scraping",
          + "webapp",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-django-assignment"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "SSR web app I built for a course, boring [mirror of https://github.com/shishifubing/app-web-django-assignment] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-django-assignment.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-web-django-assignment"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "app",
          + "bootstrap",
          + "css",
          + "css3",
          + "django",
          + "finished",
          + "finished-project",
          + "html",
          + "html5",
          + "javascript",
          + "python",
          + "python3",
          + "shishifubing",
          + "ssr",
          + "webapp",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-tianyi"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "SPA CI/CD app [mirror of https://github.com/shishifubing/app-web-tianyi] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-tianyi.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "app-web-tianyi"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "abandoned",
          + "abandoned-project",
          + "app",
          + "css",
          + "css3",
          + "go",
          + "golang",
          + "html",
          + "html5",
          + "javascript",
          + "shishifubing",
          + "vuejs",
          + "vuejs3",
          + "webapp",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["ci-actions-common"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Github actions for shishifubing repositories [mirror of https://github.com/shishifubing/ci-actions-common] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/ci-actions-common.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "ci-actions-common"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "action",
          + "actions",
          + "github-action",
          + "github-actions",
          + "shishifubing",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["infra-cloud-shishifubing.com"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Cloud infrastructure for shishifubing.com [mirror of https://github.com/shishifubing/infra-cloud-shishifubing.com] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                                               = (known after apply)
      + import_url                                       = "https://github.com/shishifubing/infra-cloud-shishifubing.com.git"
      + issues_access_level                              = (known after apply)
      + issues_enabled                                   = (known after apply)
      + lfs_enabled                                      = (known after apply)
      + merge_method                                     = (known after apply)
      + merge_pipelines_enabled                          = (known after apply)
      + merge_requests_access_level                      = (known after apply)
      + merge_requests_enabled                           = (known after apply)
      + merge_trains_enabled                             = (known after apply)
      + mirror_overwrites_diverged_branches              = (known after apply)
      + mirror_trigger_builds                            = (known after apply)
      + name                                             = "infra-cloud-shishifubing.com"
      + namespace_id                                     = 13807091
      + only_allow_merge_if_all_discussions_are_resolved = (known after apply)
      + only_allow_merge_if_pipeline_succeeds            = (known after apply)
      + only_mirror_protected_branches                   = (known after apply)
      + operations_access_level                          = (known after apply)
      + packages_enabled                                 = (known after apply)
      + pages_access_level                               = (known after apply)
      + path_with_namespace                              = (known after apply)
      + pipelines_enabled                                = (known after apply)
      + printing_merge_request_link_enabled              = (known after apply)
      + public_builds                                    = (known after apply)
      + remove_source_branch_after_merge                 = (known after apply)
      + repository_access_level                          = (known after apply)
      + repository_storage                               = (known after apply)
      + request_access_enabled                           = (known after apply)
      + requirements_access_level                        = (known after apply)
      + runners_token                                    = (sensitive value)
      + security_and_compliance_access_level             = (known after apply)
      + shared_runners_enabled                           = (known after apply)
      + snippets_access_level                            = (known after apply)
      + snippets_enabled                                 = (known after apply)
      + squash_option                                    = (known after apply)
      + ssh_url_to_repo                                  = (known after apply)
      + tags                                             = (known after apply)
      + topics                                           = [
          + "cloud",
          + "cloud-init",
          + "infrastructure",
          + "infrastructure-as-code",
          + "packer",
          + "shishifubing",
          + "terraform",
          + "terraform-module",
          + "yandex-cloud",
        ]
      + visibility_level                                 = "public"
      + web_url                                          = (known after apply)
      + wiki_access_level                                = (known after apply)
      + wiki_enabled                                     = (known after apply)

      + container_expiration_policy {
          + cadence           = (known after apply)
          + enabled           = (known after apply)
          + keep_n            = (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          + next_run_at       = (known after apply)
          + older_than        = (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["infra-repos-shishifubing"] will be created
  + resource "gitlab_project" "repositories" {
      + allow_merge_on_skipped_pipeline                  = (known after apply)
      + analytics_access_level                           = (known after apply)
      + auto_cancel_pending_pipelines                    = (known after apply)
      + auto_devops_deploy_strategy                      = (known after apply)
      + auto_devops_enabled                              = (known after apply)
      + autoclose_referenced_issues                      = (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      + build_git_strategy                               = (known after apply)
      + build_timeout                                    = (known after apply)
      + builds_access_level                              = (known after apply)
      + ci_default_git_depth                             = (known after apply)
      + ci_forward_deployment_enabled                    = (known after apply)
      + ci_separated_caches                              = (known after apply)
      + container_registry_access_level                  = (known after apply)
      + container_registry_enabled                       = (known after apply)
      + default_branch                                   = (known after apply)
      + description                                      = "Terraform module managing repositories in shishifubing organization [mirror of https://github.com/shishifubing/infra-repos-shishifubing] [2023-03-12T16:37:17Z]"
      + forking_access_level                             = (known after apply)
      + http_url_to_repo                                 = (known after apply)
      + id                      ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/shishifubing/infra-repos-shishifubing/actions/runs/4404878452">Actions</a>.<br /><br />

Pushed by: @tiandaoburen
Action: `pull_request`
